In [1]:
import numpy as np
import pandas as pd

In [ ]:
# 7행 2열 정수로 index는 1,2,3,4,5,6,7
#column은 a,b,c,d

In [9]:
dataindex = ([1,2,3,4,5,6,7])
datacolumns = (['A','B','C','D'])

In [14]:
df = pd.DataFrame(np.random.randint(1,101,size=(7,4)),
                   index=dataindex,columns=datacolumns)
#df
#df.index
#df.columns
df.values

array([[ 5, 22, 24, 13],
       [79, 31, 77,  7],
       [24, 35, 13,  7],
       [68, 48, 75, 50],
       [12, 66, 71, 26],
       [31,  2, 50, 21],
       [29, 85, 41, 87]])

In [ ]:
#실수값 랜덤
#5행 2열 
#index 자유
#columns 자유

In [17]:
dataindex2 = [1,2,3,4,5]
datacolumns2 = ['a','b']
df2 = pd.DataFrame(np.random.randn(5,2),
                  index=dataindex2,
                  columns=datacolumns2)
print(df2)

          a         b
1  0.685151  1.368938
2  0.621291  0.708200
3 -0.141738  0.457562
4  0.006196  0.390682
5  0.026586  1.093842

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       5 non-null      float64
 1   b       5 non-null      float64
dtypes: float64(2)
memory usage: 120.0 bytes

In [19]:
df2.describe()

              a         b
count  5.000000  5.000000
mean   0.239497  0.803845
std    0.383886  0.419283
min   -0.141738  0.390682
25%    0.006196  0.457562
50%    0.026586  0.708200
75%    0.621291  1.093842
max    0.685151  1.368938

In [26]:
#pandas 정령
df.sort_values(by='A',ascending=False) #A컬럼 역정령 /True는 정렬

    A   B   C   D
2  79  31  77   7
4  68  48  75  50
6  31   2  50  21
7  29  85  41  87
3  24  35  13   7
5  12  66  71  26
1   5  22  24  13

In [33]:
df.sort_values(by='A')

    A   B   C   D
1   5  22  24  13
5  12  66  71  26
3  24  35  13   7
7  29  85  41  87
6  31   2  50  21
4  68  48  75  50
2  79  31  77   7

## 데이터 검색

In [37]:
df['C']

1    24
2    77
3    13
4    75
5    71
6    50
7    41
Name: C, dtype: int32

In [41]:
#슬라이딩!!!
#행을 기준으로 슬라이딩 적용

df[0:4]

    A   B   C   D
1   5  22  24  13
2  79  31  77   7
3  24  35  13   7
4  68  48  75  50

In [40]:
df[2:5]

    A   B   C   D
3  24  35  13   7
4  68  48  75  50
5  12  66  71  26

### 데이터프레임 검색은 Loc()함수를 사용!!

In [45]:
df.loc[:,['A','B']]

    A   B
1   5  22
2  79  31
3  24  35
4  68  48
5  12  66
6  31   2
7  29  85

In [46]:
df.loc[:,['A','C','B','B']] #만들어서 사용가능!

    A   C   B   B
1   5  24  22  22
2  79  77  31  31
3  24  13  35  35
4  68  75  48  48
5  12  71  66  66
6  31  50   2   2
7  29  41  85  85

In [48]:
df.loc[1:3,['A','B']] #콜론을 기점으로 해당되는 column을 가져온다!

    A   B
1   5  22
2  79  31
3  24  35

In [60]:
df.iloc[:,[1,2,3]] #loc랑은 숫자로 표현가능!

    B   C   D
1  22  24  13
2  31  77   7
3  35  13   7
4  48  75  50
5  66  71  26
6   2  50  21
7  85  41  87

In [61]:
# iloc를 이용하세요
# 인덱스는 0값을 기준으로 1,2,3 행을 가져와 주세요
# 컬럼은 두번째,네번쨰 컬럼을 가져와 주세요

In [67]:
df.iloc[0:3,0]

1     5
2    79
3    24
Name: A, dtype: int32

In [69]:
df.A #df.['A']

1     5
2    79
3    24
4    68
5    12
6    31
7    29
Name: A, dtype: int32

In [71]:
df[df.A>30]

    A   B   C   D
2  79  31  77   7
4  68  48  75  50
6  31   2  50  21

In [72]:
df.apply(np.cumsum) #누적합

     A    B    C    D
1    5   22   24   13
2   84   53  101   20
3  108   88  114   27
4  176  136  189   77
5  188  202  260  103
6  219  204  310  124
7  248  289  351  211

In [ ]:
d